app/views/users/index.html.haml

SELECT `users`.* FROM `users`
---
      %ul
        %li=link_to t('users.all'), users_path