app/controllers/users_controller.rb

	def index
		@users = paginate(User.search(params[:search])) if params[:search].present?
---
SELECT `users`.* FROM `users`